config.org
#+title: Doom Emacs Configuration
#+AUTHOR: Peter Farr

* Startup Performance

#+begin_src emacs-lisp

;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))

(defun pmf/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                    (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'pmf/display-startup-time)

#+end_src

* Personal Information

Set my name and email for use by emacs where applicable. Some configuration use this to identify me (GPG configuration, email clients etc.)

#+BEGIN_SRC emacs-lisp
(setq user-full-name "Peter Farr"
      user-mail-address "farr.peterm@gmail.com")
#+END_SRC

* Authinfo

In emacs there's a standard by which you can store confidential information in a gpg encrypted file. You can read about how to set it up [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Authentication.html][here]].

Throughout this configuration I'll provide specifics for various packages that require confidential information, and how they expect it to be setup in your authinfo file.

Note that if you encrypt it with gpg, you should be able to edit it as if it were a normal file in emacs, and emacs will automatically handle decryption on read and encryption on write for you.
* Utilities

These go early in flow in case they get called later on

** Toggle file split

This is a helper to automatically pull up a file in a split. Calling the helper again closes the split - causing it act like a toggle

#+begin_src emacs-lisp
(defun my/toggle-file-split (filepath)
  "Toggle horizontal split showing FILEPATH.
If it's visible, close it. Otherwise, open in a horizontal split."
  (interactive "fPath to file: ")
  (let* ((fullpath (expand-file-name filepath))
         (buf (or (find-buffer-visiting fullpath)
                  (find-file-noselect fullpath)))
         (win (get-buffer-window buf t))) ;; search all visible frames
    (if win
        (delete-window win)
      (let ((new-win (split-window-below)))
        (set-window-buffer new-win buf)
        (select-window new-win)))))

(map! :leader
      :desc "Toggle gtd tasks"
      "o g" (lambda () (interactive) (my/toggle-file-split "~/org/gtd/org-gtd-tasks.org"))
      :desc "Toggle jira issues"
      "o j" (lambda () (interactive) (my/toggle-file-split "~/.org-jira/AUTH.org")))
#+end_src

** Org to Markdown Scratchpad

This provides a neat scratchpad that auto converts to markdown. Useful if you want to generate markdown for a slack buffer or other use cases. Partially this is because I can't use emacs everywhere with wayland (yet).

#+BEGIN_SRC emacs-lisp

(defun my/org-md-scratchpad ()
  "Open Org buffer, export to Markdown via Pandoc, clean output, copy to clipboard, and clean up."
  (interactive)
  (let* ((buf (generate-new-buffer "*org-md-scratchpad*"))
         (win (split-window-below)))
    (select-window win)
    (switch-to-buffer buf)
    (org-mode)
    (insert "#+BEGIN_SRC shell :results verbatim :exports both\n#+END_SRC")
    (goto-char (point-max))
    ;; Setup C-c C-c to export + copy
    (let ((map (make-sparse-keymap)))
      (set-keymap-parent map org-mode-map)
      (define-key map (kbd "C-c C-c")
                  (lambda ()
                    (interactive)
                    (let* ((scratchpad-buf (current-buffer))
                           (tmp-org (make-temp-file "scratchpad" nil ".org"))
                           (tmp-md (make-temp-file "scratchpad" nil ".md")))
                      (condition-case err
                          (progn
                            ;; Evaluate code blocks
                            (let ((org-confirm-babel-evaluate nil))
                              (org-babel-execute-buffer))
                            ;; Write Org content to temp file
                            (write-region (point-min) (point-max) tmp-org nil 'quiet)
                            ;; Run Pandoc with clean formatting options
                            (call-process "pandoc" nil nil nil
                                          tmp-org "-f" "org" "-t" "markdown"
                                          "-o" tmp-md
                                          "--wrap=none"
                                          "--markdown-headings=atx")
                            ;; Read final result and copy
                            (with-temp-buffer
                              (insert-file-contents tmp-md)
                              (kill-new (buffer-string)))
                            (message "✅ Markdown copied to clipboard.")
                            ;; Cleanup
                            (kill-buffer scratchpad-buf)
                            (when (window-live-p win)
                              (delete-window win)))
                        (error (message "❌ Export failed: %s" (error-message-string err)))))))
      (use-local-map map))))

;; Opens org to markdown scratch pad.
(map! :leader
      :desc "Org to markdown scratchpad"
      "o o" (lambda () (interactive) (my/org-md-scratchpad)))

#+END_SRC

** Set Dictionary

This sets the dictionary for spelling correction

#+begin_src emacs-lisp

(setq ispell-program-name "hunspell")
(setq ispell-dictionary "en_US")

#+end_src

* UI Configuration

** Color Theme


#+begin_src emacs-lisp

(setq doom-theme 'doom-oceanic-next)

#+end_src

** Fonts
#+BEGIN_SRC emacs-lisp

(setq doom-font (font-spec :family "Monaspace Neon" :size 16 :weight 'light)
      doom-variable-pitch-font (font-spec :family "Monaspace Argon" :size 17)
      doom-serif-font (font-spec :family "Monaspace Xenon" :size 17))

#+END_SRC

** Relative line numbers

#+begin_src emacs-lisp

(setq display-line-numbers-type 'relative)

#+end_src

* Browser Integration

I found that I needed to explicitly bind this to get my system browser to pop up when going to web links

#+BEGIN_SRC emacs-lisp

;; Enforce that emacs uses the system default browser set with
;; $ xdg-settings set default-web-browser firefox-developer-edition.desktop
(setq browser-url-browser-function 'browse-url-default-browser)

#+END_SRC

* Org Mode

[[https://orgmode.org/][Org Mode]] is one of the hallmark features of Emacs.  It is a rich document editor, project planner, task and time tracker, blogging engine, and literate coding utility all wrapped up in one package.

** Better Font Faces

The =pmf/org-font-setup= function configures various text faces to tweak the sizes of headings and use variable width fonts in most cases so that it looks more like we're editing a document in =org-mode=.  We switch back to fixed width (monospace) fonts for code blocks and tables so that they display correctly.

#+begin_src emacs-lisp

(defun pmf/org-font-setup ()
  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.0)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)
                  (org-level-8 . 1.0)))
    (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch :height 1.0)
  (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
  (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
  (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))

#+end_src

This adds a hook so our font setup runs on any org mode buffer:

#+begin_src emacs-lisp

(add-hook 'org-mode-hook #'pmf/org-font-setup)

#+end_src

