config.el
;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))

(defun pmf/display-startup-time ()
  (message "Emacs loaded in %s with %d garbage collections."
           (format "%.2f seconds"
                   (float-time
                    (time-subtract after-init-time before-init-time)))
           gcs-done))

(add-hook 'emacs-startup-hook #'pmf/display-startup-time)

(setq user-full-name "Peter Farr"
      user-mail-address "farr.peterm@gmail.com")

(defun my/toggle-file-split (filepath)
  "Toggle horizontal split showing FILEPATH.
If it's visible, close it. Otherwise, open in a horizontal split."
  (interactive "fPath to file: ")
  (let* ((fullpath (expand-file-name filepath))
         (buf (or (find-buffer-visiting fullpath)
                  (find-file-noselect fullpath)))
         (win (get-buffer-window buf t))) ;; search all visible frames
    (if win
        (delete-window win)
      (let ((new-win (split-window-below)))
        (set-window-buffer new-win buf)
        (select-window new-win)))))

(map! :leader
      :desc "Toggle gtd tasks"
      "o g" (lambda () (interactive) (my/toggle-file-split "~/org/gtd/org-gtd-tasks.org"))
      :desc "Toggle jira issues"
      "o j" (lambda () (interactive) (my/toggle-file-split "~/.org-jira/AUTH.org")))

(defun my/org-md-scratchpad ()
  "Open Org buffer, export to Markdown via Pandoc, clean output, copy to clipboard, and clean up."
  (interactive)
  (let* ((buf (generate-new-buffer "*org-md-scratchpad*"))
         (win (split-window-below)))
    (select-window win)
    (switch-to-buffer buf)
    (org-mode)
    (insert "#+BEGIN_SRC shell :results verbatim :exports both\n#+END_SRC")
    (goto-char (point-max))
    ;; Setup C-c C-c to export + copy
    (let ((map (make-sparse-keymap)))
      (set-keymap-parent map org-mode-map)
      (define-key map (kbd "C-c C-c")
                  (lambda ()
                    (interactive)
                    (let* ((scratchpad-buf (current-buffer))
                           (tmp-org (make-temp-file "scratchpad" nil ".org"))
                           (tmp-md (make-temp-file "scratchpad" nil ".md")))
                      (condition-case err
                          (progn
                            ;; Evaluate code blocks
                            (let ((org-confirm-babel-evaluate nil))
                              (org-babel-execute-buffer))
                            ;; Write Org content to temp file
                            (write-region (point-min) (point-max) tmp-org nil 'quiet)
                            ;; Run Pandoc with clean formatting options
                            (call-process "pandoc" nil nil nil
                                          tmp-org "-f" "org" "-t" "markdown"
                                          "-o" tmp-md
                                          "--wrap=none"
                                          "--markdown-headings=atx")
                            ;; Read final result and copy
                            (with-temp-buffer
                              (insert-file-contents tmp-md)
                              (kill-new (buffer-string)))
                            (message "✅ Markdown copied to clipboard.")
                            ;; Cleanup
                            (kill-buffer scratchpad-buf)
                            (when (window-live-p win)
                              (delete-window win)))
                        (error (message "❌ Export failed: %s" (error-message-string err)))))))
      (use-local-map map))))

;; Opens org to markdown scratch pad.
(map! :leader
      :desc "Org to markdown scratchpad"
      "o o" (lambda () (interactive) (my/org-md-scratchpad)))

(setq ispell-program-name "hunspell")
(setq ispell-dictionary "en_US")

(setq doom-theme 'doom-oceanic-next)

(setq doom-font (font-spec :family "Monaspace Neon" :size 16 :weight 'light)
      doom-variable-pitch-font (font-spec :family "Monaspace Argon" :size 17)
      doom-serif-font (font-spec :family "Monaspace Xenon" :size 17))

(setq display-line-numbers-type 'relative)

;; Enforce that emacs uses the system default browser set with
;; $ xdg-settings set default-web-browser firefox-developer-edition.desktop
(setq browser-url-browser-function 'browse-url-default-browser)

(defun pmf/org-font-setup ()
  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.0)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)
                  (org-level-8 . 1.0)))
    (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch :height 1.0)
  (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
  (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
  (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))

(add-hook 'org-mode-hook #'pmf/org-font-setup)
