config.el

(setq org-directory "~/org")
(setq org-agenda-files
      '("~/org/calendar-beorg.org"
        "~/org/reminders-beorg.org"))

(after! org
  ;; Add a nice drop down carrot instead of the standard [..] when collapsed
  (setq org-ellipsis " ▾")

  ;; When we are done with a todo, log the time it completed
  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)

  ;; Override doom emacs org mode todo states to change WAITING to NEXT.
  ;; This might get removed as we use org-gtd entirely now.
  (setq org-todo-keywords
        '((sequence
           "TODO(t)"     ; A task that needs doing & is ready to do
           "PROJ(p)"     ; A project, which usually contains other tasks
           "STRT(s)"     ; A task that is in progress
           "NEXT(n)"     ; A task that's on my list of things to do next
           "WAIT(w)"     ; This task is paused/on hold because I'm waiting for others
           "INBOX(i)"     ; An unconfirmed and unapproved task or notion
           "|"
           "DONE(d)"     ; Task successfully completed
           "CANCEL(c)")))    ; Task was cancelled, aborted, or is no longer applicable

  (setq org-todo-keyword-faces
        '(("STRT"   . +org-todo-active)
          ("NEXT"   . +org-todo-onhold)
          ("WAIT"   . +org-todo-onhold)
          ("PROJ"   . +org-todo-project)
          ("CANCEL" . +org-todo-cancel))))

(after! org
  ;; Persist clocks across restarts (optional but handy)
  (setq org-clock-persist 'history
        org-clock-in-resume t
        org-clock-out-remove-zero-time-clocks t
        org-clock-mode-line-total 'current) ; or 'today / 'auto

  (org-clock-persistence-insinuate)

  ;; Keep the modeline in sync when clock changes
  (add-hook 'org-clock-in-hook    #'org-clock-update-mode-line)
  (add-hook 'org-clock-out-hook   #'org-clock-update-mode-line)
  (add-hook 'org-clock-cancel-hook #'org-clock-update-mode-line))

(setq org-gtd-update-ack "3.0.0")

(use-package! org-gtd
  :after org
  :config
  (setq org-edna-use-inheritance t)
  (setq org-gtd-directory "~/org/gtd")
  (org-edna-mode)
  (map! :leader
        (:prefix ("l" . "org-gtd")
         :desc "Capture"           "c"  #'org-gtd-capture
         :desc "Engage"            "e"  #'my/org-gtd-engage
         :desc "Process inbox"     "p"  #'org-gtd-process-inbox
         :desc "Show all next"     "n"  #'org-gtd-show-all-next
         :desc "Set area of focus" "a"  #'org-gtd-area-of-focus-set-on-item-at-point
         :desc "Stuck projects"    "s"  #'org-gtd-review-stuck-projects))

  (map! :desc "Capture gtd item" "C-c c" #'org-gtd-capture)

  (map! :desc "Area of focus gtd item" "C-c a" #'org-gtd-area-of-focus-set-on-item-at-point)

  (map! :map org-gtd-clarify-map
        :desc "Organize this item" "C-c c" #'org-gtd-organize)

  ;; Setup capture templates to org-gtd inbox
  (setq org-gtd-capture-templates
        '(("i" "Inbox"
           entry  (file "~/org/gtd/inbox.org")
           "* %?\n%U\n\n"
           :kill-buffer t)
          ("l" "Inbox with link"
           entry (file "~/org/gtd/inbox.org")
           "* %?\n%U\n\n  %a"
           :kill-buffer t)
          ("s" "Slack"
           entry (file "~/org/gtd/inbox.org")
           "* [Slack thread w/ %^{Author}]: %?\n%U\n\n  %a"
           :kill-buffer t)
          ("e" "Email"
           entry (file "~/org/gtd/inbox.org")
           "* Respond to %:fromname: %:subject\n%U\n\n  %a"
           :immediate-finish t
           :kill-buffer t)))

  ;; Override the areas of focus with our own
  (setq org-gtd-areas-of-focus '("work" "coding" "music" "adventure" "family" "health" "home" "life"))

  ;; Add asking for area of focus when processing inbox
  (setq org-gtd-organize-hooks '(org-set-tags-command org-gtd-set-area-of-focus)))

(defun my/save-buffers-after-processing-inbox (&rest _)
  "Save all buffers after processing inbox."
  (save-some-buffers t))

(advice-add 'org-gtd-process--stop :after #'my/save-buffers-after-processing-inbox)
