config.org
*** Custom Engage View
This creates functionality for setting a focus for the day. When launching our custom engage view, you will be prompted to enter a focus for the day if you have not already, which will be displayed visually after the calendar view in our custom engage view

#+begin_src emacs-lisp

;; Prompt for today's daily focus if not stored yet, otherwise get from file.
(defun my/org-gtd-get-daily-focus ()
  "Get or prompt for today's focus, stored in ~/org/gtd/focus.org."
  (let* ((today (format-time-string "%Y-%m-%d"))
         (focus-file (expand-file-name "focus.org" org-gtd-directory))
         (focus-text nil))
    ;; Try to read the focus from the file if it exists
    (when (file-exists-p focus-file)
      (with-temp-buffer
        (insert-file-contents focus-file)
        (goto-char (point-min))
        (when (re-search-forward (format "^\\* %s \\(.*\\)" (regexp-quote today)) nil t)
          (setq focus-text (match-string 1)))))
    ;; If not found, prompt user and append to the file
    (unless focus-text
      (setq focus-text (read-string "Set today's focus: "))
      (with-temp-buffer
        (when (file-exists-p focus-file)
          (insert-file-contents focus-file))
        (goto-char (point-max))
        (unless (bolp) (insert "\n"))
        (insert (format "* %s %s\n" today focus-text))
        (write-region (point-min) (point-max) focus-file)))
    focus-text))

#+end_src

Our custom engage view has the agenda for the day at the top, followed by a daily focus, a list of all open projects, and then next tasks grouped by areas of focus. Note that if a todo item does not have an area of focus assigned, it won't appear in this view at all.

#+begin_src emacs-lisp

(defun my/org-gtd-engage ()
  "Show custom GTD agenda view grouped by area of focus."
  (interactive)
  (org-gtd-core-prepare-agenda-buffers)
  (with-org-gtd-context
      ;; Step 1: get today's focus
      (let* ((daily-focus (my/org-gtd-get-daily-focus))

             ;; Step 2: create header block to display focus
             (focus-block
              `(tags "+FOCUS"
                ((org-agenda-overriding-header ,(format "Today's Focus 🎯: %s" daily-focus))
                 (org-agenda-ignore-drawer-properties t)
                 (org-agenda-skip-function (lambda () t)))))  ;; dummy block just to display header

             ;; Step 3: build remaining blocks
             (next-action-blocks
              (cl-loop for area in org-gtd-areas-of-focus
                       for matcher = (format "TODO=\"NEXT\"+CATEGORY=\"%s\"" area)
                       for entries = (org-map-entries (lambda () t) matcher 'agenda)
                       unless (null entries)
                       collect `(todo ,org-gtd-next
                                 ((org-agenda-overriding-header ,(format "%s Next Actions" (capitalize area)))
                                  (org-agenda-skip-function
                                   (lambda () (org-gtd-skip-unless-area-of-focus ,area)))))))

             (agenda-block
              `(agenda ""
                ((org-agenda-span 1)
                 (org-agenda-start-day nil)
                 (org-agenda-skip-additional-timestamps-same-entry t))))

             (project-block
              `(tags ,org-gtd-project-headings
                ((org-agenda-overriding-header "Active Projects")
                 (org-agenda-sorting-strategy '(category-down)))))

             (all-blocks (append (list agenda-block focus-block project-block) next-action-blocks))

             (org-agenda-custom-commands
              `(("x" "GTD Engage View"
                 ,all-blocks
                 ((org-agenda-buffer-name "*Org GTD Engage*"))))))
        (org-agenda nil "x")
        (goto-char (point-min)))))

#+end_src

** Nicer Heading Bullets

Doom uses [[https://github.com/minad/org-modern][org-modern]] if you add the =+pretty= flag to =init.el=. We can override settings to get custom bullet points on headers

#+begin_src emacs-lisp

(after! org-modern
  ;; Customize the symbols used for headlines
  (setq org-modern-hide-stars nil  ;; optional: show leading stars
        org-modern-star '(("◉" "○" "●" "○" "●" "○" "●"))
        org-modern-fold-icons
        '((t . "▸")
          (nil . "▾"))))

#+end_src

** Center Org Buffers

I use [[https://github.com/rnkn/olivetti][olivetti]] to center =org-mode= buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document.

#+begin_src emacs-lisp

(use-package! olivetti
  :after org
  :config
  ;; Configure column width to 100
  (setq olivetti-body-width 100)
  (setq olivetti-style t)

  ;; Turn on olivetti mode which centers the content among other things
  :hook (org-mode . olivetti-mode))

#+end_src

** Git gutters in org mode

This removes git gutters in org mode, as they distract from the experience of org mode document writing. Doom emacs already adds image-mode and pdf-view-mode to the not list, so we just expand it to include org-mode. Feel free to add any extra modes you would like ignored here.

#+begin_src emacs-lisp

(after! diff-hl
  (setq diff-hl-global-modes '(not image-mode pdf-view-mode org-mode)))

#+end_src

** Org habit
This turns on and configures org habit to work

#+begin_src emacs-lisp

;; Enable org-habit to show up in agenda view
(use-package! org-habit
  :after org
  :config
  (setq org-habit-show-all-today t)
  (setq org-habit-graph-column 60))

#+end_src

** Disable line mode
This disables line mode for a number of emacs modes, but most notably org mode

#+begin_src emacs-lisp

(dolist (mode '(org-mode-hook
                term-mode-hook
                vterm-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

** Structure Templates

Org Mode's [[https://orgmode.org/manual/Structure-Templates.html][structure templates]] feature enables you to quickly insert code blocks into your Org files in combination with =org-tempo= by typing =<= followed by the template name like =el= or =ru= and then press =TAB=.  For example, to insert an empty =emacs-lisp= block below, you can type =<el= and press =TAB= to expand into such a block.

You can add more =src= block templates below by copying one of the lines and changing the two strings at the end, the first to be the template name and the second to contain the name of the language [[https://orgmode.org/worg/org-contrib/babel/languages.html][as it is known by Org Babel]].

#+begin_src emacs-lisp

(after! org
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("ru" . "src rust")))

#+end_src

** Auto-tangle Configuration Files

I used to have a helper here for auto formatting the tangled file, but I have since added this as a feature to doom emacs. If you would like to turn on auto formatting of the tangled output file, simply add the =+pretty= flag to the =literate= module in your =init.el= file. Note - this is not yet merged in. I will update this section when it is.

Separately, if you would like a helper function that can auto tangle all emacs-lisp blocks in an org file (like the one you are reading), you can use this helper function.

#+begin_src emacs-lisp

(defun pmf/org-indent-elisp-src-blocks ()
  "Indent all Emacs Lisp src blocks in the current Org buffer, then save."
  (interactive)
  (require 'ob) ;; ensure org-babel macros are loaded
  (save-excursion
    (org-babel-map-src-blocks nil ;; iterate over all babel blocks in current buffer
      (when (string= lang "emacs-lisp")
        (org-babel-do-in-edit-buffer
         (emacs-lisp-mode)
         (indent-region (point-min) (point-max)))))
    (save-buffer)))

#+end_src
** Auto save buffers after tangling

This was provided to me by the org-gtd guy - maybe get rid of my function above that hooks into org-gtd specifically and use this one instead.

#+begin_src emacs-lisp

(advice-add 'org-refile :after #'(lambda (&rest _) (org-save-all-org-buffers)))

#+end_src

* Development
** Lsp mode

*** lsp-ui

Turn off sideline entirely. I find it distracting.

#+begin_src emacs-lisp

(after! lsp-ui
  (setq lsp-ui-sideline-enable nil)
  (setq lsp-ui-sideline-show-hover nil))

#+end_src

