config.el

;; Prompt for today's daily focus if not stored yet, otherwise get from file.
(defun my/org-gtd-get-daily-focus ()
  "Get or prompt for today's focus, stored in ~/org/gtd/focus.org."
  (let* ((today (format-time-string "%Y-%m-%d"))
         (focus-file (expand-file-name "focus.org" org-gtd-directory))
         (focus-text nil))
    ;; Try to read the focus from the file if it exists
    (when (file-exists-p focus-file)
      (with-temp-buffer
        (insert-file-contents focus-file)
        (goto-char (point-min))
        (when (re-search-forward (format "^\\* %s \\(.*\\)" (regexp-quote today)) nil t)
          (setq focus-text (match-string 1)))))
    ;; If not found, prompt user and append to the file
    (unless focus-text
      (setq focus-text (read-string "Set today's focus: "))
      (with-temp-buffer
        (when (file-exists-p focus-file)
          (insert-file-contents focus-file))
        (goto-char (point-max))
        (unless (bolp) (insert "\n"))
        (insert (format "* %s %s\n" today focus-text))
        (write-region (point-min) (point-max) focus-file)))
    focus-text))

(defun my/org-gtd-engage ()
  "Show custom GTD agenda view grouped by area of focus."
  (interactive)
  (org-gtd-core-prepare-agenda-buffers)
  (with-org-gtd-context
      ;; Step 1: get today's focus
      (let* ((daily-focus (my/org-gtd-get-daily-focus))

             ;; Step 2: create header block to display focus
             (focus-block
              `(tags "+FOCUS"
                ((org-agenda-overriding-header ,(format "Today's Focus 🎯: %s" daily-focus))
                 (org-agenda-ignore-drawer-properties t)
                 (org-agenda-skip-function (lambda () t)))))  ;; dummy block just to display header

             ;; Step 3: build remaining blocks
             (next-action-blocks
              (cl-loop for area in org-gtd-areas-of-focus
                       for matcher = (format "TODO=\"NEXT\"+CATEGORY=\"%s\"" area)
                       for entries = (org-map-entries (lambda () t) matcher 'agenda)
                       unless (null entries)
                       collect `(todo ,org-gtd-next
                                 ((org-agenda-overriding-header ,(format "%s Next Actions" (capitalize area)))
                                  (org-agenda-skip-function
                                   (lambda () (org-gtd-skip-unless-area-of-focus ,area)))))))

             (agenda-block
              `(agenda ""
                ((org-agenda-span 1)
                 (org-agenda-start-day nil)
                 (org-agenda-skip-additional-timestamps-same-entry t))))

             (project-block
              `(tags ,org-gtd-project-headings
                ((org-agenda-overriding-header "Active Projects")
                 (org-agenda-sorting-strategy '(category-down)))))

             (all-blocks (append (list agenda-block focus-block project-block) next-action-blocks))

             (org-agenda-custom-commands
              `(("x" "GTD Engage View"
                 ,all-blocks
                 ((org-agenda-buffer-name "*Org GTD Engage*"))))))
        (org-agenda nil "x")
        (goto-char (point-min)))))

(after! org-modern
  ;; Customize the symbols used for headlines
  (setq org-modern-hide-stars nil  ;; optional: show leading stars
        org-modern-star '(("◉" "○" "●" "○" "●" "○" "●"))
        org-modern-fold-icons
        '((t . "▸")
          (nil . "▾"))))

(use-package! olivetti
  :after org
  :config
  ;; Configure column width to 100
  (setq olivetti-body-width 100)
  (setq olivetti-style t)

  ;; Turn on olivetti mode which centers the content among other things
  :hook (org-mode . olivetti-mode))

(after! diff-hl
  (setq diff-hl-global-modes '(not image-mode pdf-view-mode org-mode)))

;; Enable org-habit to show up in agenda view
(use-package! org-habit
  :after org
  :config
  (setq org-habit-show-all-today t)
  (setq org-habit-graph-column 60))

(dolist (mode '(org-mode-hook
                term-mode-hook
                vterm-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(after! org
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("ru" . "src rust")))

(defun pmf/org-indent-elisp-src-blocks ()
  "Indent all Emacs Lisp src blocks in the current Org buffer, then save."
  (interactive)
  (require 'ob) ;; ensure org-babel macros are loaded
  (save-excursion
    (org-babel-map-src-blocks nil ;; iterate over all babel blocks in current buffer
      (when (string= lang "emacs-lisp")
        (org-babel-do-in-edit-buffer
         (emacs-lisp-mode)
         (indent-region (point-min) (point-max)))))
    (save-buffer)))

(advice-add 'org-refile :after #'(lambda (&rest _) (org-save-all-org-buffers)))

(after! lsp-ui
  (setq lsp-ui-sideline-enable nil)
  (setq lsp-ui-sideline-show-hover nil))
