config.org
*** Flycheck popup

This customizes the flycheck popup tooltip (for lsp diagnostics) to be better stylized by using flycheck-posframe. It fakes margins by drawing boxes underneath in the same color as the expected background colors, while maintaining severity colors for error/warn/info, and adds a small white border so the box pops a bit better as well

#+begin_src emacs-lisp

(use-package! flycheck-posframe
  :after flycheck
  :hook (flycheck-mode . flycheck-posframe-mode)
  :config
  ;; thin white outline
  (setq flycheck-posframe-border-width 1
        flycheck-posframe-position 'point)
  (set-face-attribute 'flycheck-posframe-border-face nil :foreground "white")

  (defun pmf/flycheck-posframe-simple-padding ()
    (let* ((bg  (or (face-background 'flycheck-posframe-face nil t)
                    (face-background 'tooltip nil t)
                    (face-background 'default nil t)))
           (pad 10)) ;; padding thickness
      ;; padding: draw a box in the same color as the background
      (set-face-attribute 'flycheck-posframe-face nil
                          :box `(:line-width ,pad :color ,bg))
      ;; severity faces: inherit colors from error/warning/etc,
      ;; and the box from the base face (no color overrides)
      (dolist (pair '((flycheck-posframe-error-face   . error)
                      (flycheck-posframe-warning-face . warning)
                      (flycheck-posframe-info-face    . shadow)))
        (set-face-attribute (car pair) nil
                            :inherit (list (cdr pair) 'flycheck-posframe-face)
                            :foreground 'unspecified
                            :background 'unspecified
                            :box 'unspecified))))

  (add-hook 'doom-load-theme-hook #'pmf/flycheck-posframe-simple-padding)
  (pmf/flycheck-posframe-simple-padding))

#+end_src

** Rust Development Setup

This adds configuration for rust development setup, including auto formatting all buffers on save. It also turns on clippy as our linter, which is somewhat aggressive, but I find useful for helping to improve our code quality.

#+BEGIN_SRC emacs-lisp

(after! rustic
  (setq +tree-sitter-hl-enabled-modes '(rust-mode))
  (add-hook 'rust-mode-hook #'tree-sitter-mode)
  (add-hook 'rust-mode-hook #'tree-sitter-hl-mode)

  (setq lsp-enable-semantic-highlighting t)
  (add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration)
  (add-hook 'lsp-mode-hook #'lsp-semantic-tokens-mode)

  (setq lsp-rust-analyzer-cargo-watch-command "clippy")
  (setq lsp-rust-clippy-preference "on")

  (defun my/rust-enable-format-on-save ()
    (add-hook 'before-save-hook #'lsp-format-buffer nil t))

  (add-hook 'rust-mode-hook #'my/rust-enable-format-on-save))
#+END_SRC

*** REPL

To enable a Rust REPL, run the following shell command:

#+begin_src shell :tangle no

cargo install evcxr_repl

#+end_src

This section adds functionality to open a rust repl using doom emacs

#+begin_src emacs-lisp

;; Custom function to run evxcr for rust repl functionality
(defun pmf/rust-evcxr-repl ()
  "Start or switch to an evcxr REPL."
  (interactive)
  (unless (executable-find "evcxr")
    (user-error "evcxr not found on PATH. `cargo install evcxr_repl` then `doom env`"))
  (let* ((buf-name "*evcxr*")
         (buf (get-buffer buf-name)))
    (if (and buf (comint-check-proc buf))
        (pop-to-buffer buf)
      (let ((default-directory (or (and (fboundp 'projectile-project-root)
                                        (projectile-project-root))
                                   default-directory)))
        (pop-to-buffer (make-comint-in-buffer "evcxr" buf-name "evcxr" nil))))))

(after! rustic
  ;; Tell Doom's +eval to use rustic's REPL in rustic-mode
  (set-repl-handler! 'rust-mode #'pmf/rust-evcxr-repl))

#+end_src
*** Rust Playground

We can use the [[https://github.com/grafov/rust-playground][rust-playground]] package to get an impromptu local rust playground scratch pad which can be very useful.

Use =rust-playground= to spin up a new playground buffer. Once there you can type =C-c b= to flip back and forth between =main.rs= and =Cargo.toml= for adding packages as needed. Type =C-c C-c= to execute the playground and use the =rust-playground-upload= command to upload the buffer to rust playground website for sharing around!

** Magit and Forge

[[https://magit.vc/][Magit]] setup along with forge for my work Gitlab instance

You'll need to create a personal access token in Gitlab, and then provide it in your =.authinfo.gpg= file in the following format:

=machine gitlab.work-address.com login username^forge password <token here>=

#+begin_src emacs-lisp

;; Setup for magit forge with rumble gitlab instance
(setq auth-sources '("~/.authinfo.gpg"))
(after! forge
  (require 'forge-gitlab)
  (push '("git.rumble.work"           ; GITHOST in he remote URL
          "gitlab.rumble.work/api/v4" ; APIHOST (your web instance + API path)
          "gitlab.rumble.work"        ; WEBHOST (used for browsing)
          forge-gitlab-repository)    ; CLASS
        forge-alist))

#+END_SRC

** GPG Agent Fix

This fixes an issue I was having with getting emacs to find my gpg agent

#+BEGIN_SRC emacs-lisp

(setq epa-pinentry-mode 'loopback)
(setenv "GPG_TTY" (getenv "TTY"))

#+END_SRC

** Rainbow Delimiters

[[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]] is useful in programming modes because it colorizes nested parentheses and brackets according to their nesting depth.  This makes it a lot easier to visually match parentheses in Emacs Lisp code without having to count them yourself.

#+begin_src emacs-lisp

(add-hook 'prog-mode 'rainbow-delimiters-mode)

#+end_src

** Eshell

Eshell seems far more limited than vterm, but might be useful as a scheme repl, and is supposedly highly customizable. This is a small nicities update for eshell. In =packages.el= I'm using =eshell-git-prompt=. This sets the theme to use powerline

#+begin_src emacs-lisp

(eshell-git-prompt-use-theme 'powerline)

#+end_src


