config.el

(use-package! flycheck-posframe
  :after flycheck
  :hook (flycheck-mode . flycheck-posframe-mode)
  :config
  ;; thin white outline
  (setq flycheck-posframe-border-width 1
        flycheck-posframe-position 'point)
  (set-face-attribute 'flycheck-posframe-border-face nil :foreground "white")

  (defun pmf/flycheck-posframe-simple-padding ()
    (let* ((bg  (or (face-background 'flycheck-posframe-face nil t)
                    (face-background 'tooltip nil t)
                    (face-background 'default nil t)))
           (pad 10)) ;; padding thickness
      ;; padding: draw a box in the same color as the background
      (set-face-attribute 'flycheck-posframe-face nil
                          :box `(:line-width ,pad :color ,bg))
      ;; severity faces: inherit colors from error/warning/etc,
      ;; and the box from the base face (no color overrides)
      (dolist (pair '((flycheck-posframe-error-face   . error)
                      (flycheck-posframe-warning-face . warning)
                      (flycheck-posframe-info-face    . shadow)))
        (set-face-attribute (car pair) nil
                            :inherit (list (cdr pair) 'flycheck-posframe-face)
                            :foreground 'unspecified
                            :background 'unspecified
                            :box 'unspecified))))

  (add-hook 'doom-load-theme-hook #'pmf/flycheck-posframe-simple-padding)
  (pmf/flycheck-posframe-simple-padding))

(after! rustic
  (setq +tree-sitter-hl-enabled-modes '(rust-mode))
  (add-hook 'rust-mode-hook #'tree-sitter-mode)
  (add-hook 'rust-mode-hook #'tree-sitter-hl-mode)

  (setq lsp-enable-semantic-highlighting t)
  (add-hook 'lsp-mode-hook #'lsp-enable-which-key-integration)
  (add-hook 'lsp-mode-hook #'lsp-semantic-tokens-mode)

  (setq lsp-rust-analyzer-cargo-watch-command "clippy")
  (setq lsp-rust-clippy-preference "on")

  (defun my/rust-enable-format-on-save ()
    (add-hook 'before-save-hook #'lsp-format-buffer nil t))

  (add-hook 'rust-mode-hook #'my/rust-enable-format-on-save))

;; Custom function to run evxcr for rust repl functionality
(defun pmf/rust-evcxr-repl ()
  "Start or switch to an evcxr REPL."
  (interactive)
  (unless (executable-find "evcxr")
    (user-error "evcxr not found on PATH. `cargo install evcxr_repl` then `doom env`"))
  (let* ((buf-name "*evcxr*")
         (buf (get-buffer buf-name)))
    (if (and buf (comint-check-proc buf))
        (pop-to-buffer buf)
      (let ((default-directory (or (and (fboundp 'projectile-project-root)
                                        (projectile-project-root))
                                   default-directory)))
        (pop-to-buffer (make-comint-in-buffer "evcxr" buf-name "evcxr" nil))))))

(after! rustic
  ;; Tell Doom's +eval to use rustic's REPL in rustic-mode
  (set-repl-handler! 'rust-mode #'pmf/rust-evcxr-repl))

;; Setup for magit forge with rumble gitlab instance
(setq auth-sources '("~/.authinfo.gpg"))
(after! forge
  (require 'forge-gitlab)
  (push '("git.rumble.work"           ; GITHOST in he remote URL
          "gitlab.rumble.work/api/v4" ; APIHOST (your web instance + API path)
          "gitlab.rumble.work"        ; WEBHOST (used for browsing)
          forge-gitlab-repository)    ; CLASS
        forge-alist))

(setq epa-pinentry-mode 'loopback)
(setenv "GPG_TTY" (getenv "TTY"))

(add-hook 'prog-mode 'rainbow-delimiters-mode)

(eshell-git-prompt-use-theme 'powerline)
