config.el

(use-package! org-jira
  :after org
  :config
  ;; Point at work jira
  (setq jiralib-url "https://seastead.atlassian.net")
  ;; These fields will break issue creation an updating as we don't have them.
  (setq jiralib-update-issue-fields-exclude-list '(priority components))

  ;; Map jira states back to known org todo states
  (setq org-jira-done-states '("Closed" "Resolved" "Done" "Cancelled"))
  (setq org-jira-jira-status-to-org-keyword-alist '(("To Do" . "TODO")
                                                    ("In Progress" . "STRT")
                                                    ("Done" . "DONE"))))

(after! org-jira
  ;; Add mapping in org mode for org-jira-todo-to-jira - this needs to be
  ;; accessible from within org-mode generally. All org-jira keybindings are
  ;; currently scoped by the library to only work in org-jira mode, which is only
  ;; enabled on org-jira.org style files (pulled issues)
  (map! :leader
;;; <leader> j --- jira
        (:prefix-map ("j" . "jira")
         :desc "Get issues" "g" #'org-jira-get-issues))

  ;; Add logic so that when we call org-jira-todo-to-jira we insert a link to the
  ;; org-jira ticket line back onto the original todo item.
  (defvar my/org-jira--origin-marker nil
    "Marker pointing to the original Org TODO that spawned the JIRA issue.")

  (defvar my/org-jira--original-heading-text nil
    "Backup of the original TODO heading and its body.")

  ;; Before advice: store point + full heading text
  (defun my/org-jira--store-todo-entry ()
    (setq my/org-jira--origin-marker (point-marker))
    (let ((start (org-back-to-heading t))
          (end (save-excursion (org-end-of-subtree t t))))
      (setq my/org-jira--original-heading-text
            (buffer-substring-no-properties start end))))

  (defun my/org-jira--restore-todo-with-link ()
    (let (link-path link-desc ticket-id)
      ;; Step 1: get JIRA link and ticket ID from ~/.org-jira/AUTH.org
      (with-current-buffer (find-file-noselect "~/.org-jira/AUTH.org")
        (goto-char (point-max))
        (when (re-search-backward "^\\*+ +TODO\\b" nil t)
          (org-back-to-heading t)
          (let* ((link (org-store-link nil))
                 (parsed (org-link-unescape link)))
            (when (string-match "\\[\\[\\(.*?\\)\\]\\[\\(.*?\\)\\]\\]" parsed)
              (setq link-path (match-string 1 parsed))
              (setq link-desc (match-string 2 parsed)))
            ;; Extract ticket ID from heading text (e.g., AUTH-211)
            (when (re-search-forward "\\(AUTH-[0-9]+\\)" (org-entry-end-position) t)
              (setq ticket-id (match-string 1))))))

      ;; Step 2: switch back to original buffer and insert
      (when (and my/org-jira--origin-marker
                 (marker-buffer my/org-jira--origin-marker))
        (let ((origin-buf (marker-buffer my/org-jira--origin-marker)))
          (when (buffer-live-p origin-buf)
            (with-current-buffer origin-buf
              (goto-char my/org-jira--origin-marker)
              (insert my/org-jira--original-heading-text)
              ;; Move to heading and insert ticket ID prefix if available

              (save-excursion
                (org-back-to-heading t)
                (let* ((components (org-heading-components))
                       (todo (nth 2 components))
                       (heading (nth 4 components)))
                  ;; Only update heading if ticket-id is not already present
                  (when (and ticket-id
                             (not (string-prefix-p (concat ticket-id ": ") heading)))
                    ;; Reconstruct the full headline safely
                    (org-edit-headline
                     (format "%s: %s" ticket-id heading)))))

              ;; Move to end of heading and insert backlink
              (save-excursion
                (goto-char (org-entry-end-position))
                (insert "Linked JIRA ticket: ")
                (when link-path
                  (org-insert-link nil link-path link-desc))
                (insert "\n")))
            (switch-to-buffer origin-buf)
            (goto-char my/org-jira--origin-marker)
            (recenter))))))

  (advice-add 'org-jira-todo-to-jira :before #'my/org-jira--store-todo-entry)
  (advice-add 'org-jira-todo-to-jira :after  #'my/org-jira--restore-todo-with-link))

;; This is a custom function and hook that does the following:
;; 1. Intercepts when forge-create-pullreq gets called
;; 2. Grabs the jira ticket from the current branch
;; 3. Inserts the tip commit contents in as the PR contents (similar behavior to gitlab)
;; 4. Injects a "Closes <jira-ticket-id>" line into the PR details
(with-eval-after-load 'forge
  (defun my/forge--populate-pr-if-buffer ()
    "When PR buffer appears, auto-fill with commit body and JIRA ID."
    (when (string= (buffer-name) "new-pullreq")
      (remove-hook 'post-command-hook #'my/forge--populate-pr-if-buffer)
      (let* ((commit-msg (string-trim-right
                          (magit-git-output "log" "-1" "--pretty=%B")))
             (branch-name (magit-get-current-branch))
             (jira-id (when (string-match "\\bAUTH-[0-9]+\\b" branch-name)
                        (match-string 0 branch-name)))
             (closes-line (when jira-id (concat "\n\nCloses " jira-id)))
             (full-msg (concat commit-msg closes-line)))
        (goto-char (point-min))
        (when (looking-at "^#\\s-*")
          (replace-match (concat "# " full-msg))))))

  (defun my/forge--setup-auto-pr-body ()
    "Temporarily watch for the PR buffer to appear."
    (add-hook 'post-command-hook #'my/forge--populate-pr-if-buffer))

  ;; Use a safe advice wrapper that ignores arguments
  (advice-add 'forge-create-pullreq :after
              (lambda (&rest _) (my/forge--setup-auto-pr-body))))
