config.el

(use-package! slack
  :commands (slack-start)
  :bind (("C-c S K" . slack-stop)
         ("C-c S c" . slack-select-rooms)
         ("C-c S u" . slack-select-unread-rooms)
         ("C-c S U" . slack-user-select)
         ("C-c S m" . slack-im-open)
         ("C-c S s" . slack-search-from-messages)
         ("C-c S J" . slack-jump-to-browser)
         ("C-c S j" . slack-jump-to-app)
         ("C-c S e" . slack-insert-emoji)
         ("C-c S E" . slack-message-edit)
         ("C-c S r" . slack-message-add-reaction)
         ("C-c S t" . slack-thread-show-or-create)
         ("C-c S g" . slack-message-redisplay)
         ("C-c S G" . slack-conversations-list-update-quick)
         ("C-c S q" . slack-quote-and-reply)
         ("C-c S Q" . slack-quote-and-reply-with-link)
         ("C-c S T" . slack-all-threads)
         (:map slack-mode-map
               (("@" . slack-message-embed-mention)
                ("#" . slack-message-embed-channel)))
         (:map slack-thread-message-buffer-mode-map
               (("C-c '" . slack-message-write-another-buffer)
                ("@" . slack-message-embed-mention)
                ("#" . slack-message-embed-channel)))
         (:map slack-message-buffer-mode-map
               (("C-c '" . slack-message-write-another-buffer)))
         (:map slack-message-compose-buffer-mode-map
               (("C-c '" . slack-message-send-from-buffer)))
         )
  :config
  (slack-register-team
   :name "rumbleinc"
   :token (auth-source-pick-first-password
           :host "rumbleinc.slack.com"
           :user "peter.farr@rumble.com")
   :cookie (auth-source-pick-first-password
            :host "rumbleinc.slack.com"
            :user "peter.farr@rumble.com^cookie")
   :full-and-display-names t
   :default t
   :subscribed-channels '(rumble-sso-auth))

  (setq slack-block-highlight-source t))

(use-package alert
  :commands (alert)
  :init
  (setq alert-default-style 'notifier))

(after! mu4e
  ;; Each path is relative to the path of the maildir you passed to mu
  (set-email-account! "farr.peterm@gmail"
                      '((mu4e-sent-folder       . "/[Gmail].Sent Mail")
                        (mu4e-drafts-folder       . "/[Gmail].Drafts")
                        (mu4e-trash-folder       . "/[Gmail].Trash")
                        (mu4e-refile-folder       . "/[Gmail].All Mail")
                        (smtpmail-smtp-user     . "farr.peterm@gmail.com")
                        (mu4e-compose-signature . "Best,\nPeter Farr"))
                      t)

  ;; don't need to run cleanup after indexing for gmail
  (setq mu4e-index-cleanup nil
        ;; because gmail uses labels as folders we can use lazy check since
        ;; messages don't really "move"
        mu4e-index-lazy-check t)

  (setq
   user-mail-address "farr.peterm@gmail.com"
   user-full-name "Peter Farr"

   message-send-mail-function 'smtpmail-send-it
   send-mail-function 'smtpmail-send-it

   smtpmail-stream-type 'starttls
   smtpmail-smtp-server "smtp.gmail.com"
   smtpmail-smtp-service 587

   smtpmail-auth-supported '(login plain)
   smtpmail-smtp-user "farr.peterm@gmail.com"

   auth-sources '("~/.authinfo.gpg")

   smtpmail-debug-info t))

;; Make gc pauses faster by decreasing the threshold.
(setq gc-cons-threshold (* 2 1000 1000))
